Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: DcStep allows the motor to run near its load limit and at its velocity limit without losing a step.
it_it: DcStep consente al motore di funzionare vicino al limite di carico e al limite di velocità senza perdere un passo.

source: DcStep allows using up to the full available motor torque.
it_it: DcStep consente di utilizzare fino all'intera coppia motore disponibile.

source: DcStep directly integrates with the ramp generator, so that the target position will be reached, even if the motor velocity needs to be decreased due to increased mechanical load.
it_it: DcStep si integra direttamente con il generatore di rampa, in modo che la posizione target venga raggiunta anche se la velocità del motore deve essere ridotta a causa dell'aumento del carico meccanico.

source: DcStep is an automatic commutation mode for the stepper motor.
it_it: DcStep è una modalità di commutazione automatica per il motore passo-passo.

source: DcStep requires only a few settings.
it_it: DcStep richiede solo poche impostazioni.

source: Deactivates Illumination
it_it: Disattiva l'Illuminazione

source: Deactivates aim pattern.
it_it: Disattiva l'aim pattern.

source: Decode data in SSI packet format.
it_it: Decodifica i dati nel formato pacchetto SSI.

source: Decoder ACK of host demand to transmit.
it_it: ACK del decoder della richiesta di trasmissione dell'host.

source: Decoder Input.
it_it: Input del Decoder.

source: Decoder Reception Sample Code
it_it: Codice di Esempio di Ricezione del Decoder

source: Decoder Reception of Host Transmission
it_it: Ricezione del Decoder della Trasmissione Host

source: Decoder Requirements
it_it: Requisiti del Decoder

source: Decoder Transmission
it_it: Trasmissione del Decoder

source: Decoder Transmission Sample Code
it_it: Codice di Esempio per la Trasmissione del Decoder

source: Decoder Transmission to Host
it_it: Trasmissione del Decoder all'Host

source: Depending on the microstep direction one can simulate both kinds of mechanical load: braking load and acting as a generator.
it_it: A seconda della direzione dei micropassi, è possibile simulare entrambi i tipi di carico meccanico: carico di frenatura e funzionamento come generatore.

source: Depending on the supply voltage, the dependency varies.
it_it: A seconda della tensione di alimentazione, la dipendenza varia.

source: Description
it_it: Descrizione

source: Detecting a Stall
it_it: Rilevamento di uno Stallo

source: Determination of the SGT Parameter
it_it: Determinazione del parametro SGT

source: Determination of the SGTHRS Parameter
it_it: Determinazione del parametro SGTHRS

source: Document Revision
it_it: Revisione del Documento

source: Driven by the serial data transmit output of the decoder.
it_it: Controllato dall'uscita di trasmissione dati seriali del decoder.

source: Driven by the serial data transmit output of the host.
it_it: Pilotato dall'uscita di trasmissione dati seriali dell'host.

source: Drives the serial data receive input of the decoder.
it_it: Controllato dall'ingresso di ricezione dati seriali del decoder.

source: Drives the serial data receive input of the host.
it_it: Pilota l'ingresso di ricezione dati seriali dell'host.

source: Due to frequency differences of quartz oscillators (typical within range of some 0.001%) or quartz resonators (typical within range of 0.5%) the load can change slowly over time - even if two coupled stepper motor controllers are configured to run at the same speed.
it_it: A causa delle differenze di frequenza degli oscillatori al quarzo (tipicamente entro un intervallo di circa lo 0,001%) o dei risonatori al quarzo (tipicamente entro un intervallo dello 0,5%), il carico può variare lentamente nel tempo, anche se due controller per motori passo-passo accoppiati sono configurati per funzionare alla stessa velocità.

source: Due to the input protection diodes not allowing the digital inputs to rise above VCC_IO level, any active high input would hinder VCC_IO from going down.
it_it: Poiché i diodi di protezione in ingresso non consentono agli ingressi digitali di superare il livello di VCC_IO, qualsiasi ingresso attivo alto impedirebbe a VCC_IO di scendere.

source: Each datagram sent to the device is composed of an address byte followed by four data bytes.
it_it: Ogni datagramma inviato al dispositivo è composto da un byte di indirizzo seguito da quattro byte di dati.

source: Each register is accessed via 32 data bits even if it uses less than 32 data bits.
it_it: Ogni registro è accessibile tramite 32 bit di dati, anche se ne utilizza meno di 32.

source: Each step can be a fullstep or a microstep, in which there are 2, 4, 8, 16, 32, 64, 128, or 256 microsteps per fullstep.
it_it: Ogni passo può essere un fullstep o un microstep, in cui ci sono 2, 4, 8, 16, 32, 64, 128 o 256 microstep per fullstep.

source: Either an open drain (active low) output signal can be chosen (default), or an active high push-pull output signal.
it_it: È possibile scegliere un segnale di uscita a drain aperto (attivo basso) (il default) o un segnale di uscita push-pull attivo alto.

source: Enables / Disables all code types.
it_it: Abilita/disabilita tutti i tipi di codice.

source: Enables the StallGuard2 filter for more precision of the measurement.
it_it: Abilita il filtro StallGuard2 per una maggiore precisione della misurazione.

source: Energy consumption can be reduced by as much as 75%.
it_it: Il consumo energetico può essere ridotto fino al 75%.

source: Even higher short time dynamic loads can be overcome using motor and application flywheel mass without the danger of a motor stall.
it_it: Anche carichi dinamici più elevati nel breve periodo possono essere superati utilizzando il motore e la massa del volano dell'applicazione senza il pericolo di uno stallo del motore.

source: Even though StallGuard2 works with a StallGuard2 threshold parameter (SGT) out of the range of 10… +10 the set of motor parameters, speed, supply voltage, and the stall detection might work, but the combination of these parameters might be sub-optimal.
it_it: Anche se StallGuard2 funziona con un parametro di soglia StallGuard2 (SGT) al di fuori dell'intervallo 10… +10, l'insieme dei parametri del motore, velocità, tensione di alimentazione e rilevamento dello stallo potrebbe funzionare, ma la combinazione di questi parametri potrebbe non essere ottimale.

source: Event indicated by associated event code.
it_it: Evento indicato dal codice evento associato.

source: Expected Responses
it_it: Risposte Previste

source: Extinguishes LEDs.
it_it: Spegne i LED.

source: Field Name
it_it: Nome del Campo

source: Figure 1.4 Energy efficiency with CoolStep (example)
it_it: Figura 1.4 Efficienza energetica con CoolStep (esempio)

source: Figure 1.4 shows the efficiency gain of a 42mm stepper motor when using CoolStep compared to standard operation with 50% of torque reserve.
it_it: La Figura 1.4 mostra l'aumento di efficienza di un motore passo-passo da 42 mm utilizzando CoolStep rispetto al funzionamento standard con il 50% di riserva di coppia.

source: Figure 15.1 Function principle of StallGuard2
it_it: Figura 15.1 Principio di funzionamento di StallGuard2

source: Figure 15.2 Example: optimum SGT setting and StallGuard2 reading with an example motor
it_it: Figura 15.2 Esempio: impostazione ottimale di SGT e lettura di StallGuard2 con un motore di esempio

source: Figure 16.1 CoolStep adapts motor current to the load
it_it: Figura 16.1 CoolStep adatta la corrente del motore al carico

source: Figure 16.1 shows the operating regions of CoolStep:
it_it: La Figura 16.1 mostra le aree operative di CoolStep:

source: Figure 18.1 DIAG outputs in STEP/DIR mode
it_it: Figura 18.1 Uscite DIAG in modalità STEP/DIR

source: Figure 18.1 shows the available signals and control bits.
it_it: La Figura 18.1 mostra i segnali disponibili e i bit di controllo.

source: Figure 18.2 DIAG outputs with SD_MODE=0
it_it: Figura 18.2 Uscite DIAG con SD_MODE=0

source: Figure 19.1 DcStep extended application operation area
it_it: Figura 19.1 Area operativa estesa dell'applicazione DcStep

source: Figure 2.1 A single parameter named SGT (StallGuard2 threshold) configures StallGuard2
it_it: Figura 2.1 Un singolo parametro denominato SGT (soglia StallGuard2) configura StallGuard2.

source: Figure 2.10 StallGuard2 values SG with too low StallGuard2 threshold value SGT
it_it: Figura 2.10 I valori di StallGuard2 SG con un valore di soglia di StallGuard2 SGT troppo basso

source: Figure 2.11 StallGuard2 values SG with high StallGuard2 threshold value SGT
it_it: Figura 2.11 I valori di StallGuard2 SG con un valore di soglia di StallGuard2 SGT alto

source: Figure 2.12 Variation of StallGuard values SG with supply voltage
it_it: Figura 2.12 Variazione dei valori SG di StallGuard con la tensione di alimentazione

source: Figure 2.13 Dependency of StallGuard value [SG] from current scaling
it_it: Figura 2.13 Dipendenza del valore di StallGuard [SG] dalla scala di corrente

source: Figure 2.13 shows an example of StallGuard2 values SG for four different current settings (current scale CS = 7, 15, 23, 31) at different constant supply voltages without mechanical load.
it_it: La Figura 2.13 mostra un esempio di valori SG di StallGuard2 per quattro diverse impostazioni di corrente (scala di corrente CS = 7, 15, 23, 31) a diverse tensioni di alimentazione costanti senza carico meccanico.

source: Figure 2.14 Dependence of StallGuard value SG from velocity v
it_it: Figura 2.14 Dipendenza del valore SG di StallGuard dalla velocità v

source: Figure 2.14 only shows the behavior of the StallGuard2 value SG until it becomes stable with respect to increasing velocity.
it_it: La Figura 2.14 mostra solo il comportamento del valore SG di StallGuard2 fino a quando non diventa stabile rispetto all'aumento della velocità.

source: Figure 2.14 shows the StallGuard2 value SG over speed without mechanical load.
it_it: La Figura 2.14 mostra il valore di StallGuard2 SG in base alla velocità senza carico meccanico.

source: Figure 2.2 The StallGuard filter SFILT reduces noise by filtering over four full steps
it_it: Figura 2.2 Il filtro StallGuard SFILT riduce il rumore filtrando su quattro passi pieni

source: Figure 2.3 Applying mechanical load with a single motor
it_it: Figura 2.3 Applicazione del carico meccanico con un singolo motore

source: Figure 2.4 Applying mechanical motor load using a second mechanical coupled stepper motor
it_it: Figura 2.4 Applicazione del carico meccanico al motore utilizzando un secondo motore passo-passo accoppiato meccanicamente

source: Figure 2.5 Two mechanical coupled stepper motors of same type
it_it: Figura 2.5 Due motori passo-passo accoppiati meccanicamente dello stesso tipo

source: Figure 2.6 Outline of rotor and stator
it_it: Figura 2.6 Schema di rotore e statore

source: Figure 2.6 outlines the rotor and stator with magnet poles outlined (red: north pole, green: south pole).
it_it: La Figura 2.6 illustra il rotore e lo statore con i poli magnetici evidenziati (rosso: polo nord, verde: polo sud).

source: Figure 2.7 Outline of different load angles
it_it: Figura 2.7 Schema dei diversi angoli di carico

source: Figure 2.8 SG values for good choice of StallGuard2 threshold SGT
it_it: Figura 2.8 Valori SG per una buona scelta della soglia SGT di StallGuard2

source: Figure 2.9 StallGuard2 values SG decrease with increasing mechanical load
it_it: Figura 2.9 I valori di StallGuard2 SG diminuiscono all'aumentare del carico meccanico

source: Figure 24.1 Current setting and first steps with StealthChop
it_it: Figura 24.1 Impostazioni della corrente e primi passi con StealthChop

source: Figure 24.2 Tuning StealthChop and SpreadCycle
it_it: Figura 24.2 Regolazione di StealthChop e SpreadCycle

source: Figure 24.3 Moving the motor using the motion controller
it_it: Figura 24.3 Spostamento del motore utilizzando il motion controller

source: Figure 24.4 Enabling CoolStep (only in combination with SpreadCycle)
it_it: Figura 24.4 Abilitazione di CoolStep (solo in combinazione con SpreadCycle)

source: Figure 24.5 Setting up DcStep
it_it: Figura 24.5 Settaggio di DcStep

source: Figure 3.1 A single parameter named SGTHRS (StallGuard4 threshold) configures StallGuard4
it_it: Figura 3.1 Un singolo parametro denominato SGTHRS (soglia StallGuard4) configura StallGuard4.

source: Figure 3.2 Non-dependency of StallGuard4 value [SG] from voltage
it_it: Figura 3.2 Indipendenza del valore di StallGuard4 [SG] dalla tensione

source: Figure 3.2 shows an example with load at constant supply voltage together with the CoolStep function.
it_it: La Figura 3.2 mostra un esempio con carico a tensione di alimentazione costante insieme alla funzione CoolStep.

source: Figure 3.2 shows this non-dependency.
it_it: La Figura 3.2 mostra questa non dipendenza.

source: Figure 3.3 Non-dependency of StallGuard4 value [SG] from current
it_it: Figura 3.3 Indipendenza del valore di StallGuard4 [SG] dalla corrente

source: Figure 3.4 Dependency of StallGuard4 value [SG] from velocity
it_it: Figura 3.4 Dipendenza del valore di StallGuard4 [SG] dalla velocità

source: Figure 4.1 Five parameters configure smart energy CoolStep
it_it: Figura 4.1 Cinque parametri configurano CoolStep per l'energia intelligente

source: Figure 4.1 SPI timing
it_it: Figure 4.1 Temporizzazione SPI

source: Figure 4.1 shows the timing parameters of an SPI bus transaction, and the table below specifies their values.
it_it: La Figura 4.1 mostra i parametri di temporizzazione di una transazione sul bus SPI e la tabella seguente ne specifica i valori.

source: Figure 4.2 Change of SG value due to change of current done by CoolStep
it_it: Figura 4.2 Variazione del valore SG dovuta alla variazione di corrente tramite CoolStep

source: Figure 7.1 Motor coil sine wave current with StealthChop (measured with current probe)
it_it: Figura 7.1 Corrente sinusoidale della bobina del motore con StealthChop (misurata con sonda di corrente)

source: Filtering is done for noise reduction over one electrical period (four full steps) of the SG signal (Figure 2.2).
it_it: Il filtraggio viene eseguito per ridurre il rumore su un periodo elettrico (quattro passi completi) del segnale SG (Figura 2.2).

source: Finding the StallGuard2 Threshold Value (SGT Parameter)
it_it: Trovare il valore di soglia di StallGuard2 (parametro SGT)

source: Finding the StallGuard4 Threshold Value (SGTHRS Parameter)
it_it: Trovare il Valore di Soglia di StallGuard4 (Parametro SGTHRS)

source: First case (a):
it_it: Primo caso (a):

source: First one needs to switch on the current for both stepper motors.
it_it: Per prima cosa è necessario alimentare entrambi i motori passo-passo.

source: First, evaluate an application with 1/2 current setting.
it_it: Per prima cosa, valutare un'applicazione con un'impostazione di metà corrente.

source: Five more parameters control CoolStep and one status value is returned:
it_it: ltri cinque parametri controllano CoolStep e viene restituito un valore di stato:

source: Fixing the screws of the mechanical coupling element gives a mechanical coupling without torque.
it_it: Fissando le viti dell'elemento di accoppiamento meccanico si ottiene un accoppiamento meccanico senza coppia.

source: For UART based operation it is important to make sure that the CRC byte is correct.
it_it: Per il funzionamento basato su UART è importante assicurarsi che il byte CRC sia corretto.

source: For a given set of parameters one gets SG values depending on the load.
it_it: Per un dato insieme di parametri, si ottengono valori di SG in base al carico.

source: For a quick start, see the Quick Configuration Guide in chapter 24.
it_it: Per un avvio rapido, consultare la Guida Rapida Alla Configurazione nel capitolo 24.

source: For a read access the most significant bit of the address byte is 0.
it_it: Per un accesso in lettura, il bit più significativo del byte dell'indirizzo è 0.

source: For a read access to the register (XACTUAL) with the address 0x21, the address byte has to be set to 0x21 in the access preceding the read access.
it_it: Per un accesso in lettura al registro (XACTUAL) con indirizzo 0x21, il byte di indirizzo deve essere impostato a 0x21 nell'accesso precedente alla lettura.

source: For a safe and stable result, the test should be repeated with different motors and electronics and at different motor temperatures.
it_it: Per un risultato sicuro e stabile, il test deve essere ripetuto con motori ed elettronica diversi e a diverse temperature del motore.

source: For a write access the most significant bit of the address byte is 1.
it_it: Per un accesso in scrittura, il bit più significativo del byte dell'indirizzo è 1.

source: For a write access to the register (VACTUAL), the address byte has to be set to 0x80 + 0x22 = 0xA2.
it_it: Per un accesso in scrittura al registro (VACTUAL), il byte di indirizzo deve essere impostato a 0x80 + 0x22 = 0xA2.

source: For best stall detection, work without StallGuard filtering (sfilt=0).
it_it: Per un rilevamento ottimale dello stallo, lavorare senza il filtro StallGuard (sfilt=0).

source: For choosing CoolStep parameters, proceed as follows:
it_it: Per scegliere i parametri CoolStep, procedere come segue:

source: For communication to occur serial parameters must match between the host and the decoder.
it_it: Affinché la comunicazione avvenga, i parametri seriali tra host e decoder devono corrispondere.

source: For detail configuration procedure see Application Note AN003 - DcStep
it_it: Per la procedura di configurazione dettagliata vedere la nota applicativa AN003 - DcStep

source: For detail procedure see Application Note AN002 - Parameterization of StallGuard2 & CoolStep
it_it: Per la procedura dettagliata, consultare la Nota applicativa AN002 - Parametrizzazione di StallGuard2 & CoolStep

source: For each subsequent character, the host sets up an intercharacter timeout.
it_it: Per ogni carattere successivo, l'host imposta un timeout intercarattere.

source: For every bit sent from the bus master to the bus node another bit is sent simultaneously from the node to the master.
it_it: Per ogni bit inviato dal master del bus al nodo del bus, un altro bit viene inviato simultaneamente dal nodo al master.

source: For example, a large image sent by the decoder to the host is typically multi-packeted, and consists of a large transmission.
it_it: Ad esempio, un'immagine di grandi dimensioni inviata dal decoder all'host è in genere multi-pacchetto e consiste in una trasmissione di grandi dimensioni.

source: For example, if the decoder is sending decode data (as a result of scanning a bar code) and the host interrupts with a beep the beeper message, the beeper message is acted upon and acknowledged prior to transmitting the decode data message.
it_it: Ad esempio, se il decoder sta inviando dati di decodifica (a seguito della scansione di un codice a barre) e l'host interrompe con un segnale acustico il messaggio del segnale acustico, il messaggio del segnale acustico viene elaborato e riconosciuto prima di trasmettere il messaggio di dati di decodifica.

source: For example, the command “tell me your parameters” is followed by the response “my parameters are X”.
it_it: Ad esempio, il comando "dimmi i tuoi parametri" è seguito dalla risposta "i miei parametri sono X".

source: For example, the host commands “beep the beeper” and the decoder both beeps and “ACKs” as a response.
it_it: Ad esempio, l'host comanda "emetti un segnale acustico" e il decoder emette un segnale acustico e "ACK" in risposta.

source: For fast response to increasing motor load, use a high current increment step SEUP.
it_it: Per una risposta rapida all'aumento del carico del motore, utilizzare un passo di incremento di corrente elevato SEUP.

source: For higher dynamic change of load the SFILT needs to be switched off.
it_it: Per variazioni dinamiche del carico più elevate, SFILT deve essere disattivato.

source: For large stepper motors this is not possible.
it_it: Per i motori passo-passo di grandi dimensioni questo non è possibile.

source: For most industrial applications constant voltage power supplies are used.
it_it: Per la maggior parte delle applicazioni industriali vengono utilizzati alimentatori a tensione costante.

source: For our driver IC’s this is not a register, but it is implemented within the TMCL-IDE software.
it_it: Per i nostri circuiti integrati driver, questo non è un registro, ma è implementato nel software TMCL-IDE.

source: For parameterization of StallGuard2, the driving motor #1 must run faster than the load motor #2 to simulate pulling load.
it_it: Per la parametrizzazione di StallGuard2, il motore di azionamento n. 1 deve girare più velocemente del motore di carico n. 2 per simulare il carico di trazione.

source: For read access, the data bit might have any value (-).
it_it: Per l'accesso in lettura, il bit di dati può avere qualsiasi valore (-).

source: For simplification, each register is specified by a one-byte address:
it_it: Per semplificare, ogni registro è specificato da un indirizzo di un byte:

source: For small motors (NEMA 17 resp. 42er with some 0.1 Nm) one can apply mechanical load close to stall with a wheel mounted at the motor axis.
it_it: Per i motori di piccole dimensioni (NEMA 17 e 42 con circa 0,1 Nm) è possibile applicare un carico meccanico vicino allo stallo con una rotella montata sull'asse del motore.

source: For small motors one can apply mechanical load manually.
it_it: Per i motori di piccole dimensioni è possibile applicare il carico meccanico manualmente.

source: For standalone operation, no SPI interface is required to configure the TMC5130A.
it_it: Per il funzionamento standalone, non è richiesta alcuna interfaccia SPI per configurare il TMC5130A.

source: For that example, the dependency vanishes for a supply voltage of near 21.0V.
it_it: In questo esempio, la dipendenza si annulla per una tensione di alimentazione di circa 21,0 V.

source: For the ease of use, two modes of PWM regulation are provided: An automatic mode using current feedback (pwm_autoscale = 1) and a feed forward velocity-controlled mode (pwm_autoscale = 0).
it_it: Per semplicità d'uso, sono disponibili due modalità di regolazione PWM: una modalità automatica con feedback di corrente (pwm_autoscale = 1) e una modalità feed forward con controllo della velocità (pwm_autoscale = 0).

source: For these applications, the sfilt bit enables a filtering function over four load measurements.
it_it: Per queste applicazioni, il bit sfilt abilita una funzione di filtraggio su quattro misurazioni del carico.

source: For these motors, the current dependency should be checked for best result.
it_it: Per questi motori, è necessario verificare la dipendenza dalla corrente per ottenere risultati ottimali.

source: For this application, the StallGuard filtering should be turned off to give fastest response.
it_it: Per questa applicazione, il filtro di StallGuard dovrebbe essere disattivato per ottenere una risposta più rapida.

source: For using StallGuard2 itself with a constant voltage supply this is not important.
it_it: Per l'utilizzo di StallGuard2 con un'alimentazione a tensione costante, questo non è importante.

source: Format
it_it: Formato

source: From a software point of view the TMC5130A is a peripheral with a number of control and status registers.
it_it: Dal punto di vista software, il TMC5130A è una periferica dotata di numerosi registri di controllo e di stato.

source: From mathematical point of view, the StallGuard2 value
it_it: Da un punto di vista matematico, il valore di StallGuard2
